import React from "react";

const UserAgreement = () => {
  return (
    <div className="container">
      <h1>Пользовательское соглашение</h1>
      <p>
        Настоящее Пользовательское соглашение (далее — «Соглашение») заключается между Индивидуальным
        предпринимателем Ким Светланой Любомировной, администратором сайта{ " " }
        <a href="https://avalik-avatar.ru/">https://avalik-avatar.ru/</a> (далее — «Администрация»), и
        пользователем сети Интернет (далее — «Пользователь»), и регулирует отношения пользования
        услугами, оказываемыми Администрацией. Пользователем признается физическое лицо, принимающее
        условия Соглашения и зарегистрировавшееся в порядке, указанном в настоящем Соглашении, расположенном
        в сети Интернет по адресу <a href="https://avalik-avatar.ru/">https://avalik-avatar.ru/</a> (далее —
        «Сайт»).
      </p>

      <h2>1. Общие положения</h2>
      <p>
        1.1. Пользователь выражает согласие с тем, что, регистрируясь на Сайте и/или пользуясь Сайтом, он
        подтверждает, что является совершеннолетним и обязуется соблюдать условия настоящего Соглашения.
      </p>
      <p>
        1.2. Зарегистрировавшись на Сайте либо заказав услугу/продукцию на Сайте, Пользователь выражает
        свое полное и безоговорочное согласие со всеми условиями настоящего Соглашения и обязуется их
        соблюдать. В случае отсутствия у Пользователя безоговорочного согласия со всеми условиями настоящего
        Соглашения, Пользователь обязуется незамедлительно прекратить использование Сайта.
      </p>
      <p>
        1.3. Настоящее Соглашение вступает в силу с момента выражения согласия Пользователя с его условиями
        путем регистрации на сайте <a href="https://avalik-avatar.ru/">https://avalik-avatar.ru/</a>.
      </p>
      <p>
        1.4. Соглашение может быть изменено нами без какого-либо специального уведомления, новая редакция
        Соглашения вступает в силу с момента ее размещения на сайте, если иное не предусмотрено новой редакцией
        Соглашения.
      </p>

      <h2>2. Права, обязанности сторон</h2>
      <h3>2.1. Права и обязанности Пользователя:</h3>
      <p>2.1.1. Пользователь обязуется предоставлять при регистрации точные, достоверные и полные персональные данные, запрашиваемые при заполнении анкеты («Персональные данные»). Персональные данные хранятся в базе данных Администрации и подлежат использованию исключительно в соответствии с настоящим Соглашением и действующим законодательством РФ.</p>
      <p>2.1.2. Пользователь обязуется обновлять Персональные данные, предоставленные при регистрации, в случае их изменения.</p>
      <p>2.1.3. Пользователь обязуется уведомлять Администрацию и предоставлять ей информацию, подтверждающую нарушение прав, если Пользователь считает, что на Сайте присутствует информация, нарушающая его права. В случае, если Пользователь предоставит ложную информацию о нарушении его прав, он несет полную ответственность за причиненный ущерб (включая издержки, пошлины и оплату адвокатских услуг).</p>
      <p>2.1.4. Запрещается использовать Сайт в целях реализации мошеннических схем, финансовых пирамид и призывов в них участвовать.</p>

      <h3>2.2. Права и обязанности Администрации:</h3>
      <p>2.2.1. Администрация вправе предоставить Пользователю доступ к Сайту и осуществлять полную его поддержку, обеспечить сайт в рабочем состоянии.</p>
      <p>2.2.2. За нарушение условий настоящего Соглашения Администрация имеет право без предварительного уведомления блокировать доступ Пользователя к Сайту и/или удалить учетную запись Пользователя.</p>
      <p>2.2.3. Администратор обязуется оказывать техническую поддержку Пользователю по вопросам и в порядке, как указано ниже.</p>
      <p>2.2.4. Администрация вправе использовать (обрабатывать и т.п.), в соответствие с Политикой конфиденциальности, Персональные данные, указанные Пользователем при регистрации, в целях проведения мероприятий, связанных с Сервисом, а также направлять на предоставленный Пользователем электронный адрес/телефон и размещать в пространстве, ограниченном доступом Пользователя, рекламные и информационные сообщения по своему усмотрению.</p>
      <p>2.2.5. Техническая поддержка в форме письменной консультации предоставляется только по официальному запросу Пользователя, направленному в службу поддержки Сервиса по адресу: <a href="mailto:Kimsveta.coach@gmail.com">Kimsveta.coach@gmail.com</a> либо с помощью формы обратной связи, размещенной на Сайте. Консультация специалиста может быть предоставлена по следующим вопросам: регистрация и проблемы при ее прохождении, функционирование Сервиса и его инструментов. Не предоставляются консультации по вопросам настройки оборудования, программного обеспечения или Интернет-доступа Пользователя или третьих лиц, а также по другим вопросам, не имеющим отношения к работе Сайта.</p>

      <h2>3. Общие ограничения</h2>
      <p>3.1. Пользователю запрещено:</p>
      <p>3.1.1. создавать несколько учётных записей на Сайте, если фактически они принадлежат одному и тому же лицу.</p>
      <p>3.1.2. Совершать действия, направленные на введение других Пользователей в заблуждение относительно своей личности, используя учетную запись другого лица, умышленно искажать представление о самом себе, своем возрасте или своих отношениях с другими лицами или организациями;</p>
      <p>3.1.3. Регистрировать учетную запись от имени или вместо другого лица. При этом разрешена регистрация от имени и поручению другого физического лица или юридического лица при условии получения необходимых полномочий в порядке и форме, предусмотренных законодательством РФ.</p>
      <p>3.1.4. Накапливать и собирать адреса электронной почты или другую контактную информацию и личные данные Пользователей Сайта автоматизированными или иными способами для любых целей, в том числе целей рассылки не запрашиваемой почты (спама) или другой нежелательной информации.</p>
      <p>3.1.5. Размещать на Сайте домашние адреса, номера телефонов, адреса электронной почты, паспортные данные и прочую личную информацию других Пользователей или любых третьих лиц без их личного согласия на такие действия;</p>
      <p>3.1.6. Размещать любую информацию, которая, по мнению Администрации, является нежелательной, не соответствует целям создания Сайта, ущемляет интересы Пользователей или по другим причинам является нежелательной для размещения на Сайте.</p>

      <h2>4. Ответственность сторон</h2>
      <h3>4.1. Ответственность Пользователя:</h3>
      <p>4.1.1. Присоединяясь к настоящему Соглашению, Пользователь понимает, принимает и соглашается с тем, что он несет полную ответственность за сохранность своей учетной записи, а также за все действия, совершенные под своей учетной записью;</p>
      <p>4.1.2. Пользователь самостоятельно несет ответственность перед третьими лицами за свои действия или бездействия при использовании Сайта.</p>
      <p>4.1.3. Пользователь обязуется самостоятельно и за свой счет урегулировать все претензии третьих лиц, связанные с действием или бездействием Пользователя при использовании Сайта.</p>
      <p>4.1.4. Пользователь признает и соглашается, что IP-адрес персонального ЭВМ Пользователя, а также другая доступная по HTTP протоколу информация фиксируется техническими средствами Администрации, и, в случае совершения незаконных действий, в том числе действий, нарушающих интеллектуальные права третьих лиц, ответственным за указанные незаконные действия признается владелец персонального ЭВМ, определяемого техническими средствами Администрации.</p>

      <h3>4.2. Ответственность Администрации:</h3>
      <p>4.2.1. Администрация не отвечает за любое поведение Пользователей или третьих лиц, использующих или просматривающих Сайт.</p>
      <p>4.2.2. Администрация не возмещает ущерб, прямой или косвенный, причиненный Пользователю или третьим лицам в результате использования или неиспользования, в т.ч. невозможности использования Сайта.</p>
      <p>4.2.3. Администрация не несет ответственности за любые ошибки, упущения, прерывания, удаление, дефекты, задержку в обработке или передаче данных, сбои линий связи. Администрация не отвечает за любые технические сбои или иные проблемы любых телефонных сетей или служб, компьютерных систем, серверов или провайдеров, компьютерного или телефонного оборудования, программного обеспечения, сбои сервисов электронной почты или скриптов по техническим причинам.</p>
      <p>4.2.4. Администрация не несет ответственности за любой ущерб компьютеру Пользователя или иного лица, мобильным устройствам, любому другому оборудованию или программному обеспечению, вызванный или связанный со скачиванием материалов с Сайта или по ссылкам, размещенным на Сайте.</p>
      <p>4.2.5. Ни при каких обстоятельствах Администрация или ее представители не несут ответственность перед Пользователем или перед любыми третьими лицами за любые убытки, включая упущенную выгоду или потерянные данные, вред чести, достоинству или деловой репутации, вызванный в связи с использованием Сайта, содержимого Сайта или иных материалов, к которым Пользователь или иные лица получили доступ с помощью Сайта, даже если администрация предупреждала или указывала на возможность такого вреда.</p>
      <style jsx>{ `
        .container {
          width: 80%;
          margin: 0 auto;
          padding: 20px;
          padding-top: 80px;
          background-color: #fff;
          box-shadow: 0 0 10px rgba(0, 0, 0, 0.1);
        }
        `}
      </style>
    </div>
  );
};

export default UserAgreement;
