import Head from "next/head";

const PrivacyPolicy = () => {
  const pageTitle = "Аватары | Политика конфиденциальности";
  return (
    <>
      <Head>
        <title>{ pageTitle }</title>
        <meta name="robots" content="noindex" />
      </Head>
      <div className="container">
        <h1>Политика конфиденциальности</h1>

        <section>
          <h2>1. ОБЩИЕ ПОЛОЖЕНИЯ</h2>
          <p>
            1.1. Политика обработки персональных данных (далее – Политика) разработана в соответствии с Федеральным законом от 27.07.2006. №152-ФЗ «О персональных данных» (далее – ФЗ-152).
          </p>
          <p>
            1.2. Настоящая Политика определяет порядок обработки персональных данных и меры по обеспечению безопасности персональных данных с целью защиты прав и свобод человека и гражданина при обработке его персональных данных, в том числе защиты прав на неприкосновенность частной жизни, личную и семейную тайну.
          </p>
          <p>
            1.3. Использование Пользователем сайта https://avalik.picpins.ru означает согласие с настоящей Политикой конфиденциальности и условиями обработки персональных данных Пользователя.
          </p>
          <p>
            1.4. В случае несогласия с условиями Политики конфиденциальности Пользователь должен прекратить использование сайта.
          </p>
        </section>

        <section>
          <h2>2. УСЛОВИЯ ОБРАБОТКИ ПЕРСОНАЛЬНЫХ ДАННЫХ</h2>
          <div>
            2.1. Оператор производит обработку персональных данных при наличии хотя бы одного из следующих условий:
            <ul>
              <li>обработка персональных данных осуществляется с согласия субъекта персональных данных на обработку его персональных данных;</li>
              <li>обработка персональных данных необходима для достижения целей, предусмотренных международным договором Российской Федерации или законом, для осуществления и выполнения возложенных законодательством Российской Федерации на оператора функций, полномочий и обязанностей;</li>
              <li>обработка персональных данных необходима для осуществления правосудия, исполнения судебного акта, акта другого органа или должностного лица, подлежащих исполнению в соответствии с законодательством Российской Федерации об исполнительном производстве;</li>
              <li>обработка персональных данных необходима для исполнения договора, стороной которого либо выгодоприобретателем или поручителем, по которому является субъект персональных данных, а также для заключения договора по инициативе субъекта персональных данных;</li>
              <li>обработка персональных данных необходима для осуществления прав и законных интересов оператора или третьих лиц либо для достижения общественно значимых целей при условии, что при этом не нарушаются права и свободы субъекта персональных данных;</li>
              <li>осуществляется обработка персональных данных, доступ неограниченного круга лиц к которым предоставлен субъектом персональных данных либо по его просьбе (далее — общедоступные персональные данные);</li>
              <li>осуществляется обработка персональных данных, подлежащих опубликованию или обязательному раскрытию в соответствии с федеральным законом.</li>
            </ul>
          </div>
          <p>
            2.2. Оператор и иные лица, получившие доступ к персональным данным, обязаны не раскрывать третьим лицам и не распространять персональные данные без согласия субъекта персональных данных, если иное не предусмотрено федеральным законом.
          </p>
        </section>

        <section>
          <h2>3. ОСНОВНЫЕ ПРАВА И ОБЯЗАННОСТИ ОПЕРАТОРА</h2>
          <div>
            3.1. Оператор имеет право:
            <ul>
              <li>получать от субъекта персональных данных достоверные информацию и/или документы, содержащие персональные данные;</li>
              <li>в случае отзыва субъектом персональных данных согласия на обработку персональных данных Оператор вправе продолжить обработку персональных данных без согласия субъекта персональных данных при наличии оснований, указанных в Законе о персональных данных;</li>
              <li>самостоятельно определять состав и перечень мер, необходимых и достаточных для обеспечения выполнения обязанностей, предусмотренных Законом о персональных данных и принятыми в соответствии с ним нормативными правовыми актами, если иное не предусмотрено Законом о персональных данных или другими федеральными законами.</li>
            </ul>
          </div>
          <p>
            3.2. Оператор вправе передавать персональные данные третьим лицам либо поручать обработку персональных данных третьим лицам, если это будет необходимо для достижения цели их обработки в соответствии с настоящей Политикой, а также в случаях, предусмотренных действующим законодательством Российской Федерации о персональных данных.
          </p>
          <div>
            3.3. Оператор обязан:
            <ul>
              <li>предоставлять субъекту персональных данных по его просьбе информацию, касающуюся обработки его персональных данных;</li>
              <li>организовывать обработку персональных данных в порядке, установленном действующим законодательством РФ;</li>
              <li>отвечать на обращения и запросы субъектов персональных данных и их законных представителей в соответствии с требованиями Закона о персональных данных;</li>
              <li>сообщать в уполномоченный орган по защите прав субъектов персональных данных по запросу этого органа необходимую информацию в течение 30 дней с даты получения такого запроса;</li>
              <li>публиковать или иным образом обеспечивать неограниченный доступ к настоящей Политике в отношении обработки персональных данных;</li>
              <li>принимать правовые, организационные и технические меры для защиты персональных данных от неправомерного или случайного доступа к ним, уничтожения, изменения, блокирования, копирования, предоставления, распространения персональных данных, а также от иных неправомерных действий в отношении персональных данных;</li>
              <li>прекратить передачу (распространение, предоставление, доступ) персональных данных, прекратить обработку и уничтожить персональные данные в порядке и случаях, предусмотренных Законом о персональных данных;</li>
              <li>исполнять иные обязанности, предусмотренные Законом о персональных данных.</li>
            </ul>
          </div>
        </section>

        <section>
          <h2>4. ОСНОВНЫЕ ПРАВА И ОБЯЗАННОСТИ СУБЪЕКТОВ ПЕРСОНАЛЬНЫХ ДАННЫХ</h2>
          <div>
            4.1. Субъекты персональных данных имеют право:
            <ul>
              <li>получать информацию, касающуюся обработки его персональных данных, за исключением случаев, предусмотренных федеральными законами.</li>
              <li>требовать от оператора уточнения его персональных данных, их блокирования или уничтожения в случае, если персональные данные являются неполными, устаревшими, неточными, незаконно полученными или не являются необходимыми для заявленной цели обработки, а также принимать предусмотренные законом меры по защите своих прав;</li>
              <li>выдвигать условие предварительного согласия при обработке персональных данных в целях продвижения на рынке товаров, работ и услуг;</li>
              <li>на отзыв согласия на обработку персональных данных;</li>
              <li>обжаловать в уполномоченный орган по защите прав субъектов персональных данных или в судебном порядке неправомерные действия или бездействие Оператора при обработке его персональных данных;</li>
              <li>на осуществление иных прав, предусмотренных законодательством РФ.</li>
            </ul>
          </div>
          <div>
            4.2. Субъекты персональных данных обязаны:
            <ul>
              <li>предоставлять Оператору достоверные данные о себе;</li>
              <li>сообщать Оператору об уточнении (обновлении, изменении) своих персональных данных.</li>
            </ul>
          </div>
          <p>
            4.3. Лица, передавшие Оператору недостоверные сведения о себе, либо сведения о другом субъекте персональных данных без согласия последнего, несут ответственность в соответствии с законодательством РФ.
          </p>
        </section>

        <section>
          <h2>5. ОБЪЕМ И КАТЕГОРИИ ОБРАБАТЫВАЕМЫХ ПЕРСОНАЛЬНЫХ ДАННЫХ</h2>
          <div>
            5.1. Персональные данные, разрешенные к обработке в соответствии с настоящей политикой и предоставляемые Пользователями, использующими Сервис от своего имени, могут включать в себя следующую информацию:
            <ul>
              <li>имя;</li>
              <li>дата рождения;</li>
              <li>E-mail.</li>
            </ul>
          </div>
        </section>

        <section>
          <h2>6. ЦЕЛИ ОБРАБОТКИ ПЕРСОНАЛЬНЫХ ДАННЫХ</h2>
          <div>
            6.1. Цель обработки персональных данных Пользователя:
            <ul>
              <li>заключение, исполнение и прекращение гражданско-правовых договоров;</li>
              <li>предоставление доступа Пользователю к сервисам, информации и/или материалам, содержащимся на веб-сайте https://avalik.picpins.ru.</li>
            </ul>
          </div>
          <p>
            6.2. Также Оператор имеет право направлять Пользователю уведомления о новых продуктах и услугах, специальных предложениях и различных событиях.
          </p>
          <p>
            6.3. Обезличенные данные Пользователей, собираемые с помощью сервисов интернет-статистики, служат для сбора информации о действиях Пользователей на сайте, улучшения качества сайта и его содержания.
          </p>
        </section>

        <section>
          <h2>7. СПОСОБЫ И СРОКИ ОБРАБОТКИ ПЕРСОНАЛЬНОЙ ИНФОРМАЦИИ</h2>
          <p>
            7.1. Обработка персональных данных Пользователя осуществляется до достижения цели обработки персональных данных, либо до отзыва Пользователем согласия на обработку персональных данных.
          </p>
          <p>
            7.2. Персональные данные обрабатываются с использованием средств автоматизации, а также без использования таких средств.
          </p>
        </section>

        <section>
          <h2>8. МЕРЫ ПО ЗАЩИТЕ ПЕРСОНАЛЬНЫХ ДАННЫХ</h2>
          <p>
            8.1. Оператор принимает необходимые организационные и технические меры для защиты персональных данных Пользователей от неправомерного или случайного доступа, уничтожения, изменения, блокирования, копирования, распространения.
          </p>
        </section>

        <section>
          <h2>9. ЗАКЛЮЧЕНИЕ</h2>
          <p>
            9.1. Оператор имеет право в любой момент вносить изменения в настоящую Политику конфиденциальности. О таких изменениях Пользователь будет уведомлен через сайт. Внесенные изменения вступают в силу с момента их публикации, если иное не предусмотрено условиями Политики.
          </p>
        </section>
      </div>
      <style jsx>{ `
        .container {
          width: 80%;
          margin: 0 auto;
          padding: 20px;
          padding-top: 80px;
          background-color: #fff;
          box-shadow: 0 0 10px rgba(0, 0, 0, 0.1);
        }
        `}
      </style>
    </>
  );
};

export default PrivacyPolicy;
